ExtractPartAtom Method
 Writes a PartAtom XML from the contents of a family object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void ExtractPartAtom(
	string xmlFilePath
)
Visual Basic
Public Sub ExtractPartAtom ( _
	xmlFilePath As String _
)
Visual C++
public:
void ExtractPartAtom(
	String^ xmlFilePath
)
Parameters
xmlFilePath
Type: SystemString
The xml file to be saved.
Remarks
 This method is designed for a family loaded into a document in session. So it will skip the type catalog file. To extract the PartAtom XML from a family file on disk, use Application.ExtractPartAtomFromFamilyFile()
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException | If 'xmlFilePath' is a null reference (Nothing in Visual Basic) or an empty string.
See Also
Family Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →